[
    {
        "speaker": "Leila",
        "text": "If I were more assertive, I would have shared my concerns during the sprint review.",
        "ipa": "ɪf aɪ wɚ mɔɹ əˈsɝtɪv, aɪ wʊd həv ʃɛɹd maɪ kənˈsɝnz ˈdʊɹɪŋ ðə spɹɪnt ɹɪˈvju",
        "stress": "If I were more ASSERTIVE, I would have SHARED my CONCERNS during the SPRINT REVIEW.",
        "linking": "\"would have\" → /wʊd həv/ (d + h linking)\n\"shared my\" → /ʃɛɹd maɪ/ (d + m linking)"
    },
    {
        "speaker": "Dan",
        "text": "I get it. If I felt more confident about my idea, I would have jumped in earlier too.",
        "ipa": "aɪ ɡɛt ɪt. ɪf aɪ fɛlt mɔɹ ˈkɑnfɪdənt əˈbaʊt maɪ aɪˈdiə, aɪ wʊd həv dʒʌmpt ɪn ˈɝliɚ tu",
        "stress": "I GET it. If I FELT more CONFIDENT about my IDEA, I would have JUMPED in EARLIER too.",
        "linking": "\"would have\" → /wʊd həv/ (d + h linking)\n\"jumped in\" → /dʒʌmpt ɪn/ (t + i linking)"
    },
    {
        "speaker": "Leila",
        "text": "Honestly, I froze. If I weren’t so afraid of being wrong, I might have challenged that plan properly.",
        "ipa": "ˈɑnəstli, aɪ fɹoʊz. ɪf aɪ wɚnt soʊ əˈfɹeɪd əv ˈbiɪŋ ɹɔŋ, aɪ maɪt həv ˈtʃælɪndʒd ðæt plæn ˈpɹɑpɚli",
        "stress": "HONESTLY, I FROZE. If I WEREN’T so AFRAID of being WRONG, I might have CHALLENGED that PLAN PROPERLY.",
        "linking": "\"might have\" → /maɪt həv/ (t + h linking)\n\"challenged that\" → /ˈtʃælɪndʒd ðæt/ (d + th linking)"
    },
    {
        "speaker": "Dan",
        "text": "It’s hard. If you had spoken up though, they probably would have listened — you made some great points afterward.",
        "ipa": "ɪts hɑɹd. ɪf ju hæd ˈspoʊkən ʌp ðoʊ, ðeɪ ˈpɹɑbəbli wʊd həv ˈlɪsənd — ju meɪd səm ɡɹeɪt pɔɪnts ˈæftɚwɚd",
        "stress": "It’s HARD. If you had SPOKEN UP though, they probably would have LISTENED — you MADE some GREAT POINTS AFTERWARD.",
        "linking": "\"had spoken\" → /hæd ˈspoʊkən/ (d + s linking)\n\"would have\" → /wʊd həv/ (d + h linking)"
    },
    {
        "speaker": "Leila",
        "text": "Thanks. But I keep thinking… if I were more experienced, I wouldn’t have hesitated so much.",
        "ipa": "θæŋks. bət aɪ kip ˈθɪŋkɪŋ… ɪf aɪ wɚ mɔɹ ɪkˈspɪɹiənst, aɪ ˈwʊdənt həv ˈhɛzəˌteɪtɪd soʊ mʌtʃ",
        "stress": "THANKS. But I KEEP THINKING… if I were more EXPERIENCED, I WOULDN’T have HESITATED so MUCH.",
        "linking": "\"wouldn’t have\" → /ˈwʊdənt həv/ (t + h linking)\n\"hesitated so\" → /ˈhɛzəˌteɪtɪd soʊ/ (d + s linking)"
    },
    {
        "speaker": "Dan",
        "text": "Don’t worry — that confidence comes with time. If I had known how supportive the PM would be, I would have raised the issue too.",
        "ipa": "doʊnt ˈwɜɹi — ðæt ˈkɑnfɪdəns kʌmz wɪð taɪm. ɪf aɪ hæd noʊn haʊ səˈpɔɹtɪv ðə piːɛm wʊd bi, aɪ wʊd həv ɹeɪzd ði ˈɪʃu tu",
        "stress": "DON’T WORRY — that CONFIDENCE comes with TIME. If I had KNOWN how SUPPORTIVE the PM would BE, I would have RAISED the ISSUE too.",
        "linking": "\"had known\" → /hæd noʊn/ (d + n linking)\n\"would have\" → /wʊd həv/ (d + h linking)"
    }
]