[
  {
    "speaker": "Former Teammate",
    "text": "Hey! Long time no see. What have you been up to?",
    "ipa": "heɪ | ˈlɔŋ ˌtaɪm nəʊ ˈsiː | ˈwɒɾəv jə ˈbɪn ʌp tuː",
    "stress": "HEY | LONG TIME | what HAVE you BEEN UP to",
    "linking": "What have you → /ˈwɒɾəv jə/"
  },
  {
    "speaker": "You",
    "text": "Hey! Great to see you too. I’ve been working at a fintech startup for the last 8 months — we’ve been building a new payment system from scratch.",
    "ipa": "heɪ | ɡreɪt tə ˈsiː jə tuː | aɪv bɪn ˈwɜːkɪŋ ət ə ˈfɪntɛk ˈstɑːtʌp fə ðə ˌlɑːst ˈeɪt mʌnθs | wiːv bɪn ˈbɪldɪŋ ə njuː ˈpeɪmənt ˈsɪstəm frəm skrætʃ",
    "stress": "HEY | GREAT to SEE you TOO | I’VE been WORKing at a FINtech STARTup | LAST 8 MONTHS | BUILDing a NEW PAYment SYS-tem FROM SCRATCH",
    "linking": "to see you → /tə ˈsiː jə/, working at a → /ˈwɜːkɪŋ ət ə/, from scratch → /frəm skrætʃ/"
  },
  {
    "speaker": "Former Teammate",
    "text": "Wow, sounds intense. What stack are you using?",
    "ipa": "waʊ | saʊndz ɪnˈtɛns | ˈwɒt stæk ə jə ˈjuːzɪŋ",
    "stress": "WOW | SOUNDS inTENSE | what STACK are you USING",
    "linking": "stack are you → /stæk ə jə/"
  },
  {
    "speaker": "You",
    "text": "Mostly TypeScript and PostgreSQL. We’ve been using Prisma as our ORM, and I’ve been diving deep into performance tuning lately. Actually, I’ve just finished optimizing one of our most critical queries — it had been causing latency spikes for weeks.",
    "ipa": "ˈməʊstli ˈtaɪpskrɪpt ənd ˌpəʊstɡrəˈɛsˌkjuːˈɛl | wiːv bɪn ˈjuːzɪŋ ˈprɪzmə əz aʊər ˌəʊɑːˈɛm | ənd aɪv bɪn ˈdaɪvɪŋ ˈdiːp ˈɪntuː pəˈfɔːməns ˈtjuːnɪŋ ˈleɪtli | ˈækʧuəli | aɪv ʤəst ˈfɪnɪʃt ˈɒptɪmaɪzɪŋ ˈwʌn əv aʊər məʊst ˈkrɪtɪkəl ˈkwɪəriz | ɪt əd bɪn ˈkɔːzɪŋ ˈleɪtənsi spaɪks fə ˈwiːks",
    "stress": "MOSTly TYPEScript and POSTgreSQL | WE’VE been USING PRISma | OUR ORM | DIVing DEEP into PERforMANCE TUNing LATEly | FINished OPtimizing CRITical QUERies | LATENcy SPIKES for WEEKS",
    "linking": "as our ORM → /əz aʊər əʊɑːɛm/, diving deep into → /ˈdaɪvɪŋ ˈdiːp ˈɪntuː/, it had been → /ɪt əd bɪn/"
  },
  {
    "speaker": "Former Teammate",
    "text": "That’s cool. Do you miss the old days at the agency?",
    "ipa": "ðæts kuːl | dʒə jə ˈmɪs ði əʊld ˈdeɪz ət ði ˈeɪʤənsi",
    "stress": "THAT’s COOL | do you MISS the OLD DAYS at the AGENCY",
    "linking": "do you → /dʒə jə/, days at the → /ˈdeɪz ət ðə/"
  },
  {
    "speaker": "You",
    "text": "Sometimes! We used to ship stuff so fast. Remember how we would release a feature within two days of planning?",
    "ipa": "ˈsʌmtaɪmz | wiː ˈjuːst tə ʃɪp stʌf səʊ fɑːst | rɪˈmɛmbə haʊ wi wəd rɪˈliːs ə ˈfiːʧə wɪˈðɪn tuː deɪz əv ˈplænɪŋ",
    "stress": "SOMETIMES | USED to SHIP STUFF so FAST | REMEMber HOW we would RE-LEASE a FEA-ture | WITH-IN TWO DAYS of PLANning",
    "linking": "used to → /ˈjuːst tə/, release a feature → /rɪˈliːs ə ˈfiːʧə/"
  },
  {
    "speaker": "Former Teammate",
    "text": "Oh yeah — and we used to push to production without proper code review. Wild times.",
    "ipa": "əʊ jɛə | ənd wi ˈjuːst tə pʊʃ tə prəˈdʌkʃn wɪˈðaʊt ˈprɒpə kəʊd rɪˈvjuː | waɪld taɪmz",
    "stress": "OH yeah | USED to PUSH to PRODUCTION | WITH-out PROPer CODE reVIEW | WILD TIMES",
    "linking": "used to → /ˈjuːst tə/, push to → /pʊʃ tə/"
  },
  {
    "speaker": "You",
    "text": "Seriously. I’ve realized how much I’ve grown since then. I’ve become a lot more intentional with my decisions. Like, I’ve been spending more time designing before I even touch the code.",
    "ipa": "ˈsɪəriəsli | aɪv ˈrɪəlaɪzd haʊ mʌʧ aɪv ɡrəʊn sɪns ðɛn | aɪv bɪˈkʌm ə lɒt mɔː ɪnˈtɛnʃənəl wɪð maɪ dɪˈsɪʒənz | laɪk | aɪv bɪn ˈspɛndɪŋ mɔː taɪm dɪˈzaɪnɪŋ bɪˈfɔːr aɪ ˈiːvən tʌʧ ðə kəʊd",
    "stress": "SEriously | REALized how MUCH I’VE GROWN | MORE inTENtional with my DECI-sions | SPENDing MORE TIME designing | BEFORE I even TOUCH the CODE",
    "linking": "how much I’ve → /haʊ mʌʧ aɪv/, before I even → /bɪˈfɔːr aɪ ˈiːvən/"
  },
  {
    "speaker": "Former Teammate",
    "text": "Same here. What’s one thing you wish you had learned earlier?",
    "ipa": "seɪm hɪə | wɒts wʌn θɪŋ jə wɪʃ jə əd lɜːnd ˈɜːliə",
    "stress": "SAME HERE | what’s ONE THING you WISH you had LEARNED EARlier",
    "linking": "you had learned → /jə əd lɜːnd/"
  },
  {
    "speaker": "You",
    "text": "Honestly? Writing clean pull request descriptions. There were times when I had written something vague, and by the time the reviewer asked for changes, I had already forgotten what the logic was supposed to do.",
    "ipa": "ˈɒnɪstli | ˈraɪtɪŋ kliːn pʊl rɪˈkwɛst dɪˈskrɪpʃənz | ðɛə wə taɪmz wɛn aɪ əd ˈrɪtn ˈsʌmθɪŋ veɪɡ | ənd baɪ ðə taɪm ðə rɪˈvjuːə ɑːskt fə ˈʧeɪndʒɪz | aɪ əd ɔːlˈrɛdi fəˈɡɒtn wɒt ðə ˈlɒʤɪk wəz səˈpəʊzd tə duː",
    "stress": "HONestly | WRITing CLEAN PULL request deSCRIPtions | TIMES when I had WRITten someTHING VAGUE | BY the TIME the REviewER ASKED for CHANGes | FORgotten what the LOGic was supPOSED to DO",
    "linking": "I had → /aɪ əd/, supposed to → /səˈpəʊzd tə/"
  },
  {
    "speaker": "Former Teammate",
    "text": "Haha, been there. Any project that really challenged you?",
    "ipa": "ˈhɑːhɑː | bɪn ðeə | ˈɛni ˈprɒʤɛkt ðət ˈrɪəli ˈʧælɪnʤd juː",
    "stress": "HAha | BEEN THERE | ANY PROject that REALLY CHALlenged YOU",
    "linking": "challenged you → /ˈʧælɪnʤd juː/"
  },
  {
    "speaker": "You",
    "text": "Yeah — last quarter, we had to integrate with a legacy system. The devs had left, and nobody had touched the code in years. I had spent days just reading outdated docs before I even figured out where to start. It was painful, but I’ve learned a ton.",
    "ipa": "jɛə | lɑːst ˈkwɔːtə | wi əd tuː ˈɪntɪɡreɪt wɪð ə ˈlɛɡəsi ˈsɪstəm | ðə dɛvz əd lɛft | ənd ˈnəʊbɒdi əd tʌʧt ðə kəʊd ɪn jɪəz | aɪ əd spɛnt deɪz ʤəst ˈriːdɪŋ ˌaʊtˈdeɪtɪd dɒks | bɪˈfɔːr aɪ ˈiːvən ˈfɪɡəd aʊt weə tə stɑːt | ɪt wəz ˈpeɪnfʊl | bət aɪv lɜːnd ə tʌn",
    "stress": "LAST QUARter | HAD to INTEGRATE with a LEGacy SYS-tem | DEVS had LEFT | NOBoDY had TOUCHED the CODE in YEARS | SPENT DAYS just READing OUTdated DOCS | BE-FORE I even FIGured OUT WHERE to START | PAINful | I’VE LEARNED a TON",
    "linking": "had to → /əd tuː/, before I even → /bɪˈfɔːr aɪ ˈiːvən/"
  },
  {
    "speaker": "Former Teammate",
    "text": "You’ve come a long way!",
    "ipa": "juːv kʌm ə ˈlɔːŋ weɪ",
    "stress": "YOU’VE COME a LONG WAY",
    "linking": "come a → /kʌm ə/"
  },
  {
    "speaker": "You",
    "text": "Thanks! I’ve definitely been pushing myself more lately. I’ve been working on some open-source stuff after hours, and it’s helped me keep learning new tools.",
    "ipa": "θæŋks | aɪv ˈdɛfɪnətli bɪn ˈpʊʃɪŋ maɪˈsɛlf mɔː ˈleɪtli | aɪv bɪn ˈwɜːkɪŋ ɒn səm ˈəʊpənsɔːs stʌf ˈɑːftər ˈaʊəz | ənd ɪts hɛlpt mi kiːp ˈlɜːnɪŋ njuː tuːlz",
    "stress": "THANKS | I’VE DEFiniteLY been PUSHing mySELF more LATEly | WORKing on some OPEN-source STUFF afTER HOURS | HELPED me KEEP LEARNing NEW TOOLS",
    "linking": "pushing myself → /ˈpʊʃɪŋ maɪˈsɛlf/, after hours → /ˈɑːftər ˈaʊəz/"
  }
]
